app/controllers/todo_controller.rb

	def add
		content = params[:content]
		todo = Todo.new
		todo.content = content
		todo.done = false
		todo.users_id = session[:p]
		todo.save
---
INSERT INTO "todos" ("content", "done", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["done", "f"], ["users_id", 1], ["created_at", "2017-06-22 20:34:37.016234"], ["updated_at", "2017-06-22 20:34:37.016234"]]

	def done
		todo_id = params[:todo_id]
		todo = Todo.find(todo_id)
		if todo.users_id == session[:p]
			todo.done =!todo.done
			todo.save
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "todos" SET "done" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["done", "t"], ["updated_at", "2017-06-22 20:36:17.183881"], ["id", 1]]