app/controllers/user_controller.rb

  def index
	if session[:p].nil?
		return redirect_to '/user/signin'
	else
		@todos = Todo.where(users_id: session[:p])
---
SELECT "todos".* FROM "todos" WHERE "todos"."users_id" = ?  [["users_id", 1]]

def signup_submit
	password = params["password"]
	email = params["email"]
	name = params["name"]

  user = User.where(email: email).first

  if user
    return redirect_to '/user/signup'
  else
      user = User.new
      user.name = name
      user.email = email
      user.password = password
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "sachdeva.gaurav1997@gmail.com"]]
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "awe"], ["email", "sachdeva.gaurav1997@gmail.com"], ["password", "123"], ["created_at", "2017-06-22 20:20:48.650383"], ["updated_at", "2017-06-22 20:20:48.650383"]]