app/controllers/user_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1
---
  def index
	if session[:p].nil?
		return redirect_to '/user/signin'
	else
		@todos = Todo.where(user_id: session[:p])